package com.example.myapplication

import android.os.Bundle
import android.view.View
import androidx.fragment.app.Fragment
import androidx.navigation.fragment.findNavController
import androidx.recyclerview.widget.LinearLayoutManager
import androidx.recyclerview.widget.RecyclerView

class RecipesListFragment : Fragment(R.layout.fragment_recipes_list) {

    private val recipes = listOf(
        Recipes("Вареники", "Для тіста:\n" +
                "360 г борошна\n" +
                "180 мл води\n" +
                "½ ч.л. солі\n" +
                "2 ст. л. олії\n" +
                "20-30 г борошна для підпилу\n" +
                "Для начинки:\n" +
                "300 г картоплі\n" +
                "3 ст.л. олії\n" +
                "1 цибулина для начинки (приблизно 120 г)\n" +
                "1 цибулина для подачі\n" +
                "⅓ ч.л. меленого чорного перцю\n" +
                "сіль до смаку", "1. Почистьте 300 г картоплі та наріжте її великими кубиками. Перекладіть в каструлю, залийте водою і варіть 15-20 хв до готовності.\n" +
                "2. У великій мисці змішайте 360 г борошна, 180 мл води, ½ ч.л. солі, 2 ст. л. олії та замісіть еластичне тісто. Накрийте миску рушником або харчовою плівкою і дайте йому відпочити 15 хв.\n" +
                "3. 2 цибулини очистьте, наріжте дрібними кубиками та обсмажте на розігрітій сковорідці з 3 ст. л. олії до золотавого кольору. З готової картоплі злийте воду, додайте половину обсмаженої цибулі та потовчіть товкачкою. Додайте до начинки ⅓ ч.л. чорного перцю, посоліть до смаку і перемішайте. Дайте начинці охолонути.\n" +
                "4. Робочу поверхню присипте борошном. Тісто розкачайте в пласт, товщиною 0,5 мм. За допомогою склянки видавіть із тіста кружальця. На кожне таке кружальце викладіть картопляну начинку, приблизно по 1 ч. л. з гіркою. Пучками пальців защепіть краї вареників.\n" +
                "5. У каструлю наберіть води, доведіть до кипіння та посоліть, приблизно ⅓ ст. л. солі. Викладіть вареники в окріп та варіть 5 хв.\n" +
                "6. Виберіть готові вареники з каструлі, перекладіть в миску, додайте смажену цибулю.", "https://lebedyne-hnizdo.com.ua/wp-content/uploads/2020/05/Vareniki-z-kartopleju-na-paru.jpg"),
        Recipes("Борщ", "Вода – 1,5-2 л.\n" +
                "свинина або яловичина на кістці – 400 г\n" +
                "картопля – 4 шт. (середні)\n" +
                "буряк – 2 шт. (невеликі)\n" +
                "морква – 1 шт.\n" +
                "цибуля – 3 шт. (середні)\n" +
                "капуста білокачанна свіжа – 300 г\n" +
                "томатна паста – 2 ст. л.\n" +
                "соняшникова олія – 4-5 ст. л.\n" +
                "лимонна кислота – дрібка\n" +
                "сіль, лавровий лист, зелень – за смаком.", "1. Спершу варимо бульйон. У каструлю наливаємо 1,5-2 літра води. Додаємо м’ясо й ставимо на середній вогонь. Перед закипанням знімаємо піну. Щойно бульйон закипить, накриваємо кришкою і варимо на повільному вогні годину-півтори.\n" +
                "\n" +
                "2. Готуємо засмажку. Чистимо буряк, моркву та цибулю. Буряк натираємо на крупній тертці, а моркву – на середній. Цибулю нарізаємо кубиками.\n" +
                "\n" +
                "3. На середньому вогні в сковороді розігріваємо олію, висипаємо туди цибулю та моркву, смажимо 5 хвилин. Потім додаємо буряк (його можна посипати лимонною кислотою або збризнути соком свіжого лимона – так борщ буде по-справжньому червоним). Смажимо овочі ще 5 хвилин, додаємо томатну пасту, перемішуємо й смажимо все ще 5-7 хвилин.\n" +
                "\n" +
                "4. А тепер варимо сам борщ. З бульйону виймаємо м’ясо і, поки воно холоне, кидаємо в бульйон нашатковану капусту. Через 5-10 хвилин додаємо нарізану соломкою картоплю. Відокремлюємо м’ясо від кістки й нарізаємо кубиками. Повертаємо м’ясо в борщ, солимо його і додаємо засмажку. Перемішуємо борщ, кладемо лавровий лист і дрібно посічену зелень, накриваємо кришкою та варимо все ще 5-7 хвилин.\n" +
                "\n" +
                "5. Подаємо борщ зі сметаною і зеленню.", "https://www.5.ua/media/pictures/original/196917.jpg?t=1602087060"),
        Recipes("Деруни", "Картопля (середні бульби) - 5 шт.\n" +
                "Цибуля ріпчаста - 1 шт.\n" +
                "Яйце куряче - 1 шт.\n" +
                "Борошно\n" +
                "Сіль, перець чорний мелений - за смаком", "1. Картоплю та цибулю очистити. При цьому очищену картоплю не варто опускати в холодну воду, адже з неї вийде частина крохмалю.\n" +
                "\n" +
                "2. Якщо маса вийшла досить рідкою, потрібно злити трохи зайвої рідини, прикриваючи загальну масу ножем. Далі додати трохи борошна, щоб отримати потрібну консистенцію. Можна борошна і не додавати, однак, якщо картопля з низьким вмістом крохмалю, завдяки йому деруни не будуть розвалюватися.\n" +
                "\n" +
                "3. Розігріти сковороду, налити трішки олії. Смажити деруни на середньому вогні. Готові деруни викласти на серветки або паперові рушники, щоб стекла зайва олія.\n" +
                "\n" +
                "4. Деруни можна подавати зі сметаною, або ж зробити соус.\n" +
                "\n" +
                "5. Приготування соусу. Сир перетерти на сметану через дрібне сито. Добре перемішати, злегка посолити, додати розчавлений часник та зелень. \n" +
                "\n" +
                "6. Перемішати все до однорідної маси.", "https://th.bing.com/th/id/OIP._0LI1GEzYPi8-pwO1ANuJQHaFI?rs=1&pid=ImgDetMain"),
        Recipes("Сало", "свинох листочка;\n" +
                "сало;\n" +
                "100 г солі (на 1 літр води);\n" +
                "2 головки часнику;\n" +
                "пару горошин чорного перцю;\n" +
                "пару горошин запашного перцю;\n" +
                "3 лаврових листа.", "1. Посолку сала почнемо з тузлука, для цього каструлю наповнюємо водою і відразу засипаємо сіль, два види перцю і кладемо лаврушку. Як тільки рідина з приправами закипить, відразу вимикаємо нагрів і залишаємо маринад остигати.\n" +
                "\n" +
                "2. Сало ріжемо шматками, приблизно по 150 грам. Зубчики пряного овоча нарізаємо великими часточками, і кожен шматок начиняємо часником. \n" +
                "\n" +
                "3. У миску кладемо шматки сала, вливаємо розсіл і зверху ставимо прес, прикриваємо і переносимо в холод на 5 днів. \n" +
                "\n" +
                "4. Після сало з маринаду дістаємо, розкладаємо по пакетах і прибираємо в морозилку.", "https://static.gotujmy.pl/ZDJECIE_PORADY_B/slonina-to-rarytas-326386.jpg"),
        Recipes("Сирні галушки з салом", "Борошно пшеничне 200 гр.\n" +
                "Сир плавлений 180 гр.\n" +
                "Куряче яйце 2 шт.\n" +
                "Сіль 1 щіпка\n" +
                "Сало свиняче 120 гр.\n", "1. Підморожений плавлений сир подрібнюємо на терці.\n" +
                "\n" +
                "2. До сиру вбиваємо яйця та всипаємо борошно – замішуємо тісто.\n" +
                "\n" +
                "3. Відокремлюємо від маси невеликі скибочки та формуємо галушки. Обвалюємо у борошні з усіх боків.\n" +
                "\n" +
                "4. Відварюємо напівфабрикати в киплячій підсоленій воді протягом 10 хвилин. Нарізаємо брусками сало.\n" +
                "\n" +
                "5. Смажимо до утворення характерної скоринки.\n" +
                "\n" +
                "6. Викладаємо галушки на тарілку, зверху – засмажка, знімаємо пробу.", "https://f.authenticukraine.com.ua/photo/5245/jQOR6.jpg")

        )

    override fun onViewCreated(view: View, savedInstanceState: Bundle?) {
        super.onViewCreated(view, savedInstanceState)

        val recyclerView: RecyclerView = view.findViewById(R.id.recyclerView)
        recyclerView.layoutManager = LinearLayoutManager(requireContext())
        recyclerView.adapter = RecipesAdapter(recipes) { selectedRecipes ->
            navigateToRecipesDetail(selectedRecipes)
        }
    }

    private fun navigateToRecipesDetail(recipes: Recipes) {
        val action = RecipesListFragmentDirections.actionRecipesListFragmentToRecipesDetailFragment(recipes)
        findNavController().navigate(action)
    }
}